update docs and book
